Giesekus/concentratedSolution/f=5.905Hz_zo=0.2mm/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

runApplication $application

runApplication postProcess -func sampleDict
