Giesekus/concentratedSolution/f=5.905Hz_zo=0.2mm/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
	{                
		type             GiesekusLog;

		rho              rho [1 -3 0 0 0 0 0] 1050;
		etaS             etaS [1 -1 -1 0 0 0 0] 0;
		etaP             etaP [1 -1 -1 0 0 0 0] 64;             
		lambda           lambda [0 0 1 0 0 0 0] 1.9;
		alpha            alpha [0 0 0 0 0 0 0] 0.85; 
	   
		stabilization    coupling;              
	}

passiveScalarProperties
	{
		solvePassiveScalar   no;
		D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
	}

// ************************************************************************* //
